<template>
  <div class="terms">
    <HeaderTop />
    <h1>Пользовательское соглашение</h1>
    <div class="text">
      <p>

        Пожалуйста, ознакомьтесь с настоящим пользовательским соглашением до начала использования сайта <a href="https://csgorave.com" target="_blank">csgorave.com</a> и его программных средств
        <br><br>
        Регистрация (авторизация) на сайте будет означать ваше согласие с условиями настоящего пользовательского соглашения
        <br><br>
        Если Вы не согласны с условиями настоящего пользовательского соглашения, не регистрируйтесь (авторизируйтесь) на сайте и не используйте его программные средства
        <br><br>
        CSGORAVE не связан со Steam или Valve Corporation
        <br><br>
        Пользовательское соглашение
        Версия от 15.03.2023
        <br><br>
        ITCSRAVE LTD. с одной стороны и лицо, акцептовавшее оферту, размещенную в сети Интернет по постоянному адресу <a
          href="https://csgorave/support/user-agreement" target="_blank">https://csgorave/support/user-agreement</a>, с другой стороны, заключили настоящее пользовательское соглашение о нижеследующем
        <br><br>
        <strong>1.	Термины и определения</strong>
        <br>1.1. В настоящем пользовательском соглашении, если из текста прямо не вытекает иное, следующие термины будут иметь указанные ниже значения.
        <br><br>
        Служба Steam
        Онлайновая услуга, предлагаемая корпорацией Valve, являющейся правообладателем объектов Инвентаря
        <br><br>
        Владелец
        ITCSRAVE LTD., юридическое лицо, зарегистрированное по законодательству Великобритании, Company number 156246765 with registered address at 36 Frosts Mews, Ellesmere Port, Cheshire, United Kingdom, CH65 2HX.
        <br><br>
        Инвентарь
        Возможность использовать инвентарь CS:GO объектов в соответствии с соглашением подписчика службы Steam, размещенным в сети Интернет по адресу: http://store.steampowered.com/subscriber_agreement/russian/
        <br><br>
        Режимы
        Совокупность защищенных страниц Сайта, созданных в результате регистрации Пользователя, используя которые Пользователь имеет возможность пользоваться всеми или некоторыми функциональными возможностями Сайта
        <br><br>
        Доступ в Личный кабинет осуществляется в следующем порядке
        <br><br>
        - нажатие кнопки «Авторизироваться через Steam» на Сайте, после чего Пользователь будет автоматически перенаправлен на сайт в сети Интернет по адресу: https://steamcommunity.com/
        - внесение Пользователем имени пользователя (подписчика) Steam и пароля в специальную форму, нажатие кнопки «Войти», расположенные в сети Интернет по адресу https://steamcommunity.com/
        - либо посредством открытия Сайта в случае, если Пользователь ранее не производил выход из Личного кабинета путем нажатия кнопки «Выход»
        <br><br>
        Пользователь
        Физическое лицо, имеющее аккаунт Steam, заключившее с Владельцем Соглашение
        <br><br>
        Сайт
        Составные произведения, представляющие собой совокупность информации, текстов, графических элементов, дизайна, изображений, фото и видеоматериалов, программ для ЭВМ, иных результатов интеллектуальной деятельности, за исключением Инвентаря, содержащихся в информационной системе, обеспечивающей доступность такой информации в сети Интернет в пределах доменной зоны csgorave.com
        <br><br>
        Игровые Режимы - это совокупность информации, текстов, графических элементов, дизайна, изображений, фото и видеоматериалов, программ для ЭВМ, иных результатов интеллектуальной деятельности, за исключением Инвентаря. Наименнование которых «Краш», «Джекпот» и «Рулетка».
        <br><br>
        Краш - это режим игры, в котором нужно успеть нажать кнопку Stop и выйти из игры до того как произойдет Краш и игра остановится
        <br><br>
        Джекпот - это режим игры, в котором слайдер останавливается на случайном игроке, который забирает весь банк.
        <br><br>
        Рулетка -  это режим игры, в котором всего 4 цвета: синий, зелёный, фиолетовый и золотой. Для ставок доступно только 3 цвета. Синий — при выигрыше увеличивает сумму ставки в 2 раза.
        Зеленый — при выигрыше увеличивает сумму ставки в 3 раза. Фиолетовый — при выигрыше увеличивает сумму ставки в 5 раз. Золотой — при выигрыше увеличивает сумму ставки в 20 раз.
        Обычный баланс или предметы можно поставить сразу в три цвета.
        <br><br>
        Мультиаккаунтинг - это два и более зарегистрированных аккаунта на сайте csgorave.com, регистрация которых проходит на чужие или дополнительные аккаунты одного пользователя в Steam или любых других формах регистрации на сайте
        <br><br>
        Соглашение
        Настоящее пользовательское соглашение
        <br><br>
        Стороны
        Владелец и Пользователь
        <br><br>
        1.2. Все остальные термины и определения, встречающиеся в тексте Соглашения, толкуются Сторонами в соответствии с законодательством Объединенного Королевства Великобритании и сложившимися в сети Интернет обычными правилами толкования соответствующих терминов
        1.3. Названия заголовков (статей) Соглашения предназначены исключительно для удобства пользования текстом Соглашения и буквального юридического значения не имеют
        <br><br>
        2. Заключение Соглашения
        <br>2.1. Текст Соглашения, постоянно размещенный в сети Интернет по сетевому адресу <a href="https://csgorave/support/user-agreement" target="_blank">https://csgorave/support/user-agreement</a> и доступный при регистрации (авторизации) на Сайте, содержит все существенные условия Соглашения и является предложением Владельца заключить Соглашение с любым полностью дееспособным третьим лицом, использующим Сайт, на указанных в тексте Соглашения условиях
        <br>2.2. Таким образом, текст Соглашения является публичной офертой
        <br>2.3. Надлежащим акцептом настоящей оферты считается последовательное осуществление третьим лицом, следующих действий
        <br>2.3.1.Ознакомление с условиями Соглашения
        <br>2.3.2. Проставление символа в специальном поле под заголовком «Я принимаю условия пользовательского соглашения»
        <br>2.3.3. Авторизация на Сайте путем перехода по ссылке «Авторизироваться через Steam» и осуществления авторизации в открывшемся окне через уже имеющийся аккаунт Steam или путем создания нового аккаунта Steam
        <br><br>
        <strong>3. Предмет Соглашения</strong>
        <br>3.1. Владелец предоставляет Пользователю
        <br>3.1.1. безвозмездную простую (неисключительную) лицензию на использование Сайта и его программных средств по их прямому назначению, как то предусмотрено явными пользовательскими функциями Сайта и Личного кабинета
        <br>3.1.2. возмездную простую (неисключительную) лицензию на использование средств баланса в игровых Режимах по его прямому назначению, при этом стоимость лицензии на использование в определенном игровом Режиме которая проходит на Сайте
        <br>3.2. Указанная в пункте 3.1.1 Соглашения лицензия предоставляется Пользователю на срок, в течение которого, и в пределах территории, на которой Сайт и Личный кабинет остаются доступными для Пользователя
        <br>3.3. Указанная в пункте 3.1.2 Соглашения лицензия предоставляется Пользователю в пределах территории, на которой возможность игры в Игровые Режимы остается доступным для Пользователя в течение срока с момента оплаты Пользователем вознаграждения за использование конкретного игрового Режима до момента определения Инвентаря с помощью такой игры
        <br>3.4. Пользователю запрещается
        <br>3.4.1. обходить технические ограничения, установленные на Сайте и в игровых Режимах
        <br>3.4.2. изучать технологию, декомпилировать или дизассемблировать Сайт, игровые Режимы и Личный кабинет, за исключением случаев, прямо предусмотренных законодательством Объединенного Королевства Великобритании
        <br>3.4.3. создавать копии экземпляров Сайта и Личного кабинета, а также их внешнего оформления (дизайна)
        <br>3.4.4. изменять Сайт, игровые Режимы и Личный кабинет каким бы то ни было способом
        <br>3.4.5. совершать действия, направленные на изменение функционирования и работоспособности Сайта, Игровых Режимов и Личного кабинета
        <br>3.4.5.1. пользователь не имеет права дополнительно использовать другие программы или механизмы в игровых Режимах, на сайте или в Личном кабинете ( скрипты , боты и любые другие средства которые могут помочь получить преимущество перед другими игроками или перед администрацией сайта)
        <br>3.4.6. предоставлять доступ к Личному кабинету третьему лицу, а так же, использовать Личный кабинет третьих лиц
        <br>3.4.7. пользователь имеет право использовать только один аккаунт на данном сайте, мультиаккаунтинг категорически запрещен и карается блокировкой всех аккаунтов и средств, безвозвратно
        <br>3.4.8. публично обвинять сайт в обмане или всячески клеветать сайт, это карается блокировкой аккаунта без возврата средств
        <br>3.4.9. использовать часть либо полное наименование секретного кода / промокода при создании своего реферального кода, после публикации первого
        <br><br>
        <strong>4. Функции Сайта,  игровых Режимов и Личного кабинета</strong>
        <br>4.1. Пользователь посредством Сайта имеет возможность
        <br>4.1.1.знакомиться с содержанием и характеристиками Инвентаря, получение которого происходит посредством игр в игровых Режимах,
        <br>4.2. приобретать лицензию на использование игровых Режимов и получать соответствующий Инвентарь в порядке, указанном в Соглашении
        <br>4.3. Пользователь посредством Личного кабинета имеет возможность
        <br>4.3.1. принять Инвентарь в аккаунт Steam
        <br>4.3.2. осуществить путем совершения действия или бездействия с момента получения Инвентаря посредством игры в игровые Режимы отчуждение Инвентаря за бонусные баллы, в количестве, указанном в описании Инвентаря в Личном кабинете, дающие право на получение скидки при оплате лицензионного вознаграждения за игру в игровые Режимы
        <br><br>
        <strong>5. Приемка Инвентаря</strong>
        <br>5.1. С момента получения Инвентаря посредством получения выгоды и игровых Режимах и его отображением в Личном кабинете, Пользователь в течение 1 (одного) года имеет возможность принять Инвентарь в аккаунт Steam, либо осуществить отчуждение Инвентаря посредством Личного кабинета
        <br>5.2. Приемка Инвентаря в аккаунт Steam осуществляется при условии выполнения Пользователем указанных на Сайте и в Личном кабинете настроек аккаунта Steam и Личного кабинета
        <br>5.3. Для приемки Инвентаря в аккаунт Steam при условии соблюдения требований пункта 5.2 Соглашения, Пользователь в течение 1 (одного) года с момента получения Инвентаря переходит по ссылке «ЗАБРАТЬ», расположенной в Личном кабинете непосредственно в описании такого Инвентаря
        <br>5.4. Пользователь имеет возможность осуществить отчуждение полученного, но ещё не принятого в аккаунт Steam Инвентаря за указанное в описании Инвентаря в Личном кабинете количество бонусных баллов, дающих право на скидку при оплате лицензионного вознаграждения за возможность участвовать в игровых Режимах, при этом один бонусный балл дает право на скидку в один рубль исключительно для указанных целей (оплата лицензионного вознаграждения)
        <br>5.5. Стороны согласовали, что указанные бонусные баллы не являются денежными средствами и не подлежат возврату и/или обмену
        <br>5.6. Для отчуждения Инвентаря Пользователь в течение 1 (одного) часа с момента получения Инвентаря переходит по соответствующей ссылке, расположенной в Личном кабинете непосредственно с описанием такого Инвентаря
        <br>5.7. Бездействие Пользователя по истечении 1 (одного) часа с момента получения Инвентаря означает отчуждение им полученного, но ещё не принятого в аккаунт Steam Инвентаря
        <br>5.8. При отчуждении Инвентаря полученные Пользователем бонусные баллы отображаются в Личном кабинете
        <br>5.9. Возврат денежных средств со счета не предусмотрен , клиент может получить компенсацию только в качестве инвентаря в аккаунт Steam, в случае , если не было нарушено ни одно правило из пунктов данного соглашения и внутренних директив компании
        <br>5.10. Лимит вывода зависит от истории транзакций на сайте каждого пользователя и рассматривается в каждом случае индивидуально, пользователь будет проходить внутреннюю проверку Владельца для подтверждения соблюдения условий данного соглашения перед выводом. В случае успешной проверки Владелец даст возможность Пользователю произвести вывод. Факт успешной проверки на один вывод не дает Пользователю автоматическое подтверждение правомерности вывода в следующий запрос, каждый вывод проходит индивидуальную проверку. Владелец оставляет за собой право заблокировать последующие выводы и сам аккаунт Пользователя в случае нарушения пунктов данного соглашения вне зависимости от того в какой момент было совершено нарушение и сколько прошло времени его момента
        <br><br>
        <strong>6. Вознаграждение Владельца</strong>
        <br>6.1. За предоставленное Владельцем право использования игровых Режимов Пользователь выплачивает лицензионное вознаграждение в размере, указанном на Сайте
        <br>6.2. Указанное в пункте 6.1 Соглашения лицензионное вознаграждение выплачивается Пользователем из денежных средств, заранее переданных Владельцу посредством платежного сервиса, информация о котором доступна Пользователю в момент оплаты
        <br>6.3. Сумма заранее переданных денежных средств отображается в Личном кабинете
        <br>6.4. Передача денежных средств Владельцу в счет оплаты указанного в пункте 6.1 Соглашения лицензионного вознаграждения осуществляется Пользователем способом, в порядке и по правилам, указанным на соответствующей странице Сайта, с учетом особенностей и требований, устанавливаемых соответствующим платежным сервисом, привлеченным Владельцем для осуществления расчетов
        <br>6.5. Моментом выплаты указанного в пункте 6.1 Соглашения лицензионного вознаграждения является момент списания соответствующей суммы денежных средств, заранее переданных Владельцу, о чем Пользователь информируется соответствующим изменением баланса в Личном кабинете
        <br>6.6. Оплата указанного в пункте 6.1 Соглашения лицензионного вознаграждения в порядке, предусмотренном настоящим разделом, осуществляется с учетом положения пункта 5.6 Соглашения
        <br><br>
        <strong>7. Персональные данные</strong>
        <br>7.1. Пользователь дает свое согласие Владельцу на обработку информации, в том числе, персональных данных Пользователя, предоставленных при использовании Сайта, а именно данных, указанных в аккаунте Пользователя в Steam
        <br>7.2. Обработка персональных данных означает запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), в том числе трансграничную, обезличивание, блокирование, удаление, уничтожение персональных данных, не подпадающих под специальные категории, на обработку которых, согласно действующему законодательству Объединенного Королевства Великобритании , требуется письменное согласие Пользователя
        <br>7.3. Обработка персональных данных производится в целях исполнения Сторонами обязательств по Соглашению, регистрации Пользователя на Сайте, приобретения лицензии на участие в игровых Режимах, получения Инвентаря, направления на адрес электронной почты Пользователя сообщений информационного и иного характера
        <br>7.4. Пользователь может в любое время отозвать согласие на обработку персональных данных, направив Владельцу соответствующее письменное уведомление на адрес, указанный в пункте 1.1 Соглашения, заказным письмом с уведомлением о вручении
        <br>7.5. При этом Пользователь понимает, что такой отзыв означает прекращение действия Соглашения
        <br>7.6. Владелец вправе продолжить обработку персональных данных Пользователя в предусмотренных законом случаях
        <br>7.7. Дополнительные или иные положения в отношении обработки персональных данных могут содержаться в соответствующем документе, размещенном или размещаемом на Сайте
        <br>7.8. В случае, противоречия положений такого документа положениям настоящего раздела применяются положения документа
        <br>7.9. Пользователь дает согласие на получение рекламных материалов от Владельца, его аффилированных лиц либо от иных лиц по поручению Владельца на адрес электронной почты, указанный Пользователем при регистрации в аккаунте Steam
        <br>7.10. Согласие на получение рекламных материалов может быть отозвано Пользователем в любое время путем направления Владельцу соответствующего письменного уведомления на адрес, указанный в пункте 1.1 Соглашения, либо путем совершения действий, указанных в сообщениях (электронных письмах), содержащих такие материалы
        <br><br>
        <strong>8. Ограничение ответственности</strong>
        <br>8.1. Владелец не отвечает за убытки Пользователя, возникшие в результате неправомерных действий третьих лиц, в том числе связанных с неправомерным доступом к Личному кабинету
        <br>8.2.Владелец не несет ответственность за убытки, причиненные Пользователю в результате разглашения третьим лицам учетных данных, необходимых для доступа к Личному кабинету, произошедшего не по вине Владельца
        <br>8.3. Владелец не является правообладателем объектов Инвентаря, не определяет порядок использования и функционирование Инвентаря
        <br>8.4. В отношении Инвентаря Пользователь руководствуется лицензионным соглашением Steam, доступным на момент составления редакции Соглашения по адресу http://store.steampowered.com/subscriber_agreement/russian/
        <br>8.5. Владелец не предоставляет программные средства для использования Инвентаря по прямому назначению на устройстве Пользователя
        <br>8.6. Такие программные средства Пользователь приобретает и/или устанавливает на свое устройство самостоятельно
        <br>8.7. Сайт и его программные средства, в том числе Личный кабинет и игровые Режимы, предоставляются «Как есть»
        <br>8.8. На Пользователе лежит риск использования Сайта
        <br>8.9. Владелец, операторы проводной и беспроводной связи, по сетям которых предоставляется доступ к Сайту, аффилированные лица, поставщики, агенты Владельца не предоставляют каких бы то ни было гарантий в отношении Сайта
        <br>8.10. Владелец не гарантирует, что Сайт, игровые Режимы и Личный кабинет соответствуют требованиям Пользователя, что доступ к Сайту, игровым Режимам и Личному кабинету будет предоставляться непрерывно, быстро, надежно и без ошибок
        <br>8.11. Программно-аппаратные ошибки, как на стороне Владельца, так и на стороне Пользователя, приведшие к невозможности получения Пользователем доступа к Сайту и/или игровым Режимам, и/или Личному кабинету, являются обстоятельствами непреодолимой силы, и основанием освобождения от ответственности за неисполнение обязательств Владельца по Соглашению
        <br>8.12. Владелец вправе уступать права и переводить долги, по всем обязательствам, возникшим из Соглашения
        <br>8.13. Настоящим Пользователь дает свое согласие на уступку прав и перевод долга любым третьим лицам
        <br>8.14. О состоявшейся уступке прав и/или переводе долга Владелец информирует Пользователя, размещая соответствующую информацию на Сайте
        <br>8.15. Размер убытков, которые могут быть возмещены Владельцем Пользователю, в любом случае ограничен в соответствии с положениями данного соглашения суммой в 1 000 (одну тысячу) рублей
        <br>8.16. Если иное не предусмотрено Соглашением в случае нарушения Пользователем условий Соглашения Владелец вправе в одностороннем порядке отказаться от исполнения Соглашения и прекратить доступ Пользователя к Личному кабинету
        <br>8.17. В случае если такое нарушение причинило ущерб третьим лицам, ответственность за них полностью лежит на Пользователе
        <br><br>
        <strong>9. Порядок разрешения споров</strong>
        <br>9.1. Все споры, разногласия и претензии, которые могут возникнуть в связи с исполнением, расторжением или признанием недействительным Соглашения, Стороны будут стремиться решить путем переговоров
        <br>9.2. Сторона, у которой возникли претензии и/или разногласия, направляет другой Стороне сообщение с указанием возникших претензий и/или разногласий в соответствии с пунктом 9.1 Соглашения
        <br>9.3. В случае если ответ на сообщение не будет получен направившей сообщение Стороной в течение 30 (тридцати) рабочих дней с даты направления соответствующего сообщения, либо если Стороны не придут к соглашению по возникшим претензиям и/или разногласиям, спор подлежит разрешению в судебном порядке по месту нахождения Владельца
        <br><br>
        <strong>10. Заключительные положения</strong>
        <br>10.1. Настоящим Стороны подтверждают, что при исполнении (изменении, дополнении, прекращении) Соглашения, а также при ведении переписки по указанным вопросам, допускается использование аналогов собственноручной подписи Сторон
        <br>10.2. Стороны подтверждают, что все уведомления, сообщения, соглашения и документы в рамках исполнения Сторонами обязательств, возникших из Соглашения, подписанные аналогами собственноручной подписи Сторон, имеют юридическую силу и обязательны для исполнения Сторонами
        <br>10.3. Под аналогами собственноручной подписи понимаются уполномоченные адреса электронной почты и учетные данные к Личному кабинету
        <br>10.4. Стороны признают, что все уведомления, сообщения, соглашения, документы и письма, направленные с использованием уполномоченных адресов электронной почты и Личного кабинета, считаются направленными и подписанными Сторонами, кроме случаев, когда в таких письмах прямо не указано обратное
        <br>10.5. Уполномоченными адресами электронной почты Сторон признаются
        <br>10.5.1. для Владельца: csgorave@rambler.ru
        <br>10.5.2. для Пользователя: адрес электронной почты, указанный при регистрации аккаунта в Steam
        <br>10.6.Стороны обязуются обеспечивать конфиденциальность сведений и информации, необходимых для доступа к уполномоченным адресам электронной почты и Личному кабинету, не допускать разглашение такой информации и передачу третьим лицам
        <br>10.7.Стороны самостоятельно определяют порядок ограничения доступа к такой информации
        <br>10.8. При использовании уполномоченных адресов электронной почты, до момента получения от второй Стороны информации о нарушении режима конфиденциальности, все действия и документы, совершенные и направленные с помощью уполномоченного адреса электронной почты второй Стороны, даже если такие действия и документы были совершены и направлены иными лицами, считаются совершенными и направленными такой второй Стороной
        <br>10.9. В этом случае права и обязанности, а также ответственность наступают у такой второй Стороны
        <br>10.10. При использовании Личного кабинета, до момента получения от Пользователя информации о нарушении режима конфиденциальности, все действия и документы, совершенные и направленные с помощью Личного кабинета, даже если такие действия и документы были совершены и направлены иными лицами, считаются совершенными и направленными Пользователем
        <br>10.11. В этом случае права и обязанности, а также ответственность наступают у Пользователя
        <br>10.12. Настоящее Пользовательское соглашение является собственностью компании, а также вся информация на данном сайте и не подлежит копированию или разглашению третьим лицам. В дополнение к правилам, описанным в пользовательском соглашении, Владелец также руководствуется внутренними директивами компании, которые не подлежат разглашению, но не отрицают того факта, что Владелец имеет право применять внутренние директивы при предоставлении услуг Пользователю
        <br><br>
        <strong>11. Изменение условий Соглашения</strong>
        <br>11.1. Владелец вправе в одностороннем порядке изменять условия Соглашения, при этом такие изменения вступают в силу в момент опубликования новой версии Соглашения в сети Интернет по адресу
        <a href="https://csgorave/support/user-agreement" target="_blank">https://csgorave/support/user-agreement</a>
        <br>11.2. Продолжение использования функций Сайта будет означать согласие Пользователя с условиями новой версии Соглашения
        <br>11.3. Если Пользователь не согласен с условиями новой версии Соглашения, он прекращает пользоваться Сайтом
        <br>11.4. Во всем остальном, что не урегулировано Соглашением, Стороны руководствуются действующим законодательством Объединенного Королевства Великобритании без учета его коллизионных норм

      </p>
    </div>
  </div>
</template>
<script setup>
import HeaderTop from "@/components/main/HeaderTop.vue";
</script>
<style scoped lang="scss">
.terms {
  padding: 15px 12px;
  h1 {
    font-weight: 700;
    font-size: 24px;
    line-height: 35px;
    margin-bottom: 20px;
  }
  p {
    font-weight: 500;
    font-size: 14px;
    line-height: 21px;
    strong {
      display: block;
    }
    color: #97A7DB;
  }
  a {
    color: #4E70E9;
    text-decoration: underline;
  }
}
</style>